<?php

/* @var $this yii\web\View */

$this->title = 'Основное веб-приложение';
?>
<div class="site-index">

    <div class="jumbotron">
        <h2>Тестовое задание: «Основное веб-приложение»</h2>
        <ol>
            <li>
            Задача: Результатом должно быть веб-приложение, которое позволяет войти, зарегистрироваться, отобразить поля профиля, изменить статус онлайн / оффлайн
            </li>
            <li>
            Цель проекта: определить подход кандидата к выполнению поставленной задачи и масштабы ее реализации.
            </li>
            <li>
            Роли и функциональные требования:
            Гость - пользователь, который после входа на стартовую страницу может либо зарегистрироваться, либо войти, если учетная запись (профиль) уже существует. Гость может видеть всех пользователей в системе (имя, фамилия).
            </li>
            <li>
            Поля регистрации: имя, адрес электронной почты, пароль, пароль еще раз, капча. Адреса электронной почты пользователей должны быть уникальными.
            </li>
            <li>
            Зарегистрированный пользователь - пользователь, который зарегистрировался и уже имеет учетную запись (профиль). Зарегистрированный пользователь может видеть всех пользователей в системе (их профили). Он может изменить свой статус (онлайн / оффлайн).
            </li>
            <li>
            Аккаунт пользователя (профиль) содержит информацию о пользователе: имя, фамилия, онлайн-статус (онлайн, оффлайн).
            </li>
            <li>
            Нефункциональные требования:
            Приложение должно быть реализовано на PHP с использованием PHP MVC Yii Framework. Пользовательский интерфейс не является обязательным, по словам разработчика. Кандидат должен использовать базовую функциональность фреймворка без каких-либо дополнительных расширений.
            </li>
        </ol>
    </div>
</div>
